In [1]:
import pandas as pd
from numpy import NaN

<br><br><br>

Creating the dataframe

In [2]:
data = {
    'age': [10,22,13,21,12,11,17],
    'section': ['A','B','C','B','B','A','A'],
    'city': ['Gurgaon','Delhi','Mumbai','Delhi','Mumbai','Delhi','Mumbai'],
    'gender': ['M','F','F','M','M','M','F'],
    'favorite_color': ['red',NaN,'yellow',NaN,'black','green','red']   
}

df = pd.DataFrame(data)
df

   age section     city gender favorite_color
0   10       A  Gurgaon      M            red
1   22       B    Delhi      F            NaN
2   13       C   Mumbai      F         yellow
3   21       B    Delhi      M            NaN
4   12       B   Mumbai      M          black
5   11       A    Delhi      M          green
6   17       A   Mumbai      F            red

<br><br><br>

Records where age >= 15

In [3]:
df.query('age >= 15')
# df[df.age >= 15]
# df.iloc[df.age.ge(15).values]
# df.loc[df.age.ge(15).values]

   age section    city gender favorite_color
1   22       B   Delhi      F            NaN
3   21       B   Delhi      M            NaN
6   17       A  Mumbai      F            red

<br><br><br>

Records where age >= 12 and gender = Male

In [4]:
df.query('age >= 12 and gender == "M"')

   age section    city gender favorite_color
3   21       B   Delhi      M            NaN
4   12       B  Mumbai      M          black

<br><br><br>

Records of index 1 & 3

In [5]:
df.iloc[ [1,3] ]
# df.query('index == 1 or index == 3')

   age section   city gender favorite_color
1   22       B  Delhi      F            NaN
3   21       B  Delhi      M            NaN

<br><br><br>

Records where age >= 12 and print only the city and gender columns

In [6]:
df.query('age >= 12')[ ['city','gender'] ]
# df[df.age >= 12][ ['city','gender'] ]
# df.loc[ df.age.ge(12).values, ['city','gender'] ]

     city gender
1   Delhi      F
2  Mumbai      F
3   Delhi      M
4  Mumbai      M
6  Mumbai      F

<br><br><br>